{"2985":{"post_title":"Life was simple once","ID":"2985","post_content":"<!-- wp:heading -->\n<h2 id=\"the-pervasiveness-of-the-technological-age\">The pervasiveness of the technological age.<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>A telephone was a device for conversation between two people. People wrote letters when they had finished writing they put them in the mailbox. A car may have a radio in it; most cars did have one at all.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Now we have all this “stuff” that is connected. Connected in multiple ways as well. We have a phone that can bring the world to our fingertips. # more This phone can live in our pocket or bag, store our music or our life, our address book, reminders for life events. It even has a browser that connects to the internet so we can search, read blogs – like this one; and write emails. Saints preserve us if this phone is lost or stolen.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We have a tablet that can do as much as a phone. For instance, it provides us the ability to contact patients via eHealth apps, giving our elderly relatives and friends a helping hand to stay in their homes for longer. Our phones and tablets even take photos, as quickly and as cheaply as a digital camera of today, unlike back in those simpler times.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There is an idea that technology had not impacted our lives. I believe this is false. For workers, employees it has meant that they work later, from home on their phones, tablets or computers. The workday does not end when they leave the office. For business owners, technology is often the bane of their lives. Especially if said technology fails. Have we not read about those times in the paper or should I say online! Technology can now even run our homes to be more energy-efficient.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As a child, I longed for the day when life as shown in the cartoon “The Jetson’s” would become a reality. Flying cars, Robot maids, auto dog walkers and communication with others at my fingertips, that was the life to have. Life in the cartoon seemed to have a sense of being less complicated with the use of technology, not more.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So how is technology being pervasive in our lives? What “stuff” has technology in it that we forget that it has? Those are the questions. The flip side question is, how can technology help my business now and the future?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Technology has invaded our lives one bit at a time, professionally and personally. By its very nature technology is stealthy. It makes our lives better by making it easier to do things. However, the reality is that this may not be. For people of a certain age, the record of their life is stored electronically. From movies, music and book preferences through to having pictures of their lives or their conversational history with friends on this device call a ‘smart’ device. You know – phones or tablets that are available now. It is not necessarily that these devices are ‘smart’. They have a small footprint – with a computer that can access voice and data networks. They also have the programs we are choosing to use, like word processors, messaging and email.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Organisations can take advantage of this by having a digital presence. This can take many forms from:<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>a website readable on any device (hopefully)<\/li><li>to a dedicated program for just what service they are supplying the public,<\/li><li>right through to other internet gatherings like social networks – Facebook, Twitter, LinkedIn – to name a few.<\/li><\/ul>\n<!-- \/wp:list -->\n\n<!-- wp:paragraph -->\n<p>The danger with this is that we can start to allow our view of the world and life be dictated or shaped by this prism of technology we use. Especially social media – and those who manipulate it.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For most people, that is just fine the way things are. Yet to reach them means that you have to get through all this digital ‘noise’. Is it no wonder that we are bombarded by adverts on our electronic mediums. It reminds me of commercial television. Ads every 5 minutes it seemed.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Having a strategy to cut through the noise is important and it sometimes means doing a variety of things to get noticed.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 id=\"the-future-is-here\">The Future is Here:<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Well apart from having flying cars readily for sale that is!<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We are daily bombarded with news articles and social media memes and posts that being on the internet is not safe. This is scary as the people of the world have not yet gained the wisdom so often sought after. Human nature is after all human nature and it has not changed in a long long time.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The United States of America has a President that is spouting all sorts of things and uses Twitter™ to rant or tell people non-truths. There have been election campaigns that used social media and technology to sway voters to thinking that they voted for an “authentic” representation of them. There has even been Faked News that entraps the gullible. Not to mention the manipulation of Social Media from foreign governments.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>I suppose that is where this is leading being “authentic” in the digital world. The idealised world of the Jetsons did have its problems and it also provided a simple look at what could be in the future. Being authentic was not really a feature of that story. We are entering an era where it is more and more digitised – the Internet of Things. So how as a business person do you show your nature online.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>One way is to ensure that how you act in person is how you act online. Remembering what our grannies said in that if you would not say it to someone face-to-face do not write it down, or video it. Being truthful to yourself is how your customers will know who you are just like going to the greengrocer or local deli or even your favourite coffee shop. They will also know who you are from your actions online, where actions definitely speak louder than words sometimes.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 id=\"so-what-can-you-do\">So what can you do:<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Choose your social media networks carefully – not all networks are created equally and choosing the right one will help you with your digital strategy without dodgy tactics. Ensure that from a business perspective that everything you post is something you would be happy to read or know. If what you are posting is in-line with your business and personal values (they could be one and the same), then you know that your followers will be able to know what you stand for. Just like you get to know your favourite coffee shop, your followers will get to know you, through your posts. Think of them as conversations that you would have over the counter when ordering that coffee. Your followers become customers and will purchase from you, or vice versa. The Internet of Things is here, it snuck up on us while we weren’t watching. Being conscious of security and privacy online means that even a private citizen has to think about theses, let alone product makers who never did before. Being authentic is one way to show who you are, in this world of self-driving cars (thanks, Elon Musk), televisions that can connect to the internet and record your favourite shows and your house wired up so you can control it from your phone. It is not about hanging out all your “dirty laundry” for people to dredge through.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We have entered the brave new world – it is up to us to decide how we will use the technology available to us to enhance our lives, our businesses. To protect what needs to be protected and keep vigilant through it all.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>At GraphitEdge, acknowledges this ‘noise’ and is here to help you make the most of what you need to do.<\/p>\n<!-- \/wp:paragraph -->","post_excerpt":"","post_date":"2021-03-02 14:36:39","post_name":"life-was-simple-once","post_author":"me@graphitedge.com.au","post_status":"publish","featured_image":"","post_format":"standard","comment_status":"closed","ping_status":"closed","name":"","featured_image_title":"","featured_image_caption":"","featured_image_alt_text":"","featured_image_description":"","featured_file_name":"","post_category":"life work balance","post_tag":"","blocksy_post_meta_options":"Array","et_enqueued_post_fonts":"Array|Array"},"2993":{"post_title":"Conversations with your Web Developer, Agency or Designer - 1","ID":"2993","post_content":"<!-- wp:paragraph -->\n<p>Have you gone through a website build only to not have your requirements not met? Have you been looking for someone to build your website, yet find that there is often too high a price to pay? Have you had a web designer, developer or agency string you along and not delivered? Have you gone into a website build only to discover what was not delivered was not what you required? I noticed there are a plethora of posts on “questions to ask your web designer or developer”. These articles prescribe any number of between 5 to 20 questions you should ask. These tend to prescribe a grilling your prospective web technologist. This first meeting is a conversation. This is the start of a relationship. This continues throughout the development of your website. There are areas of this conversation that cover most of these questions. This conversation allows you to build a rapport with your prospective web technologist. Site development should be the web technologist choice. Don’t get caught up in it. If you have a specific need such as integrating an ETSY store or providing a shopping cart, let them know. Sometimes, having a little bit of knowledge about something can be dangerous. You may not understand it to the depth of your web technologist. You would not tell the plumber how to do his or her job the same happens when you engage a web technologist. Tell them what you would like to do online. Let them decide how to do this with the best and most appropriate platforms for your business. After all you are paying them to do the research to help your business grow.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 id=\"topics-for-questions\">Topics for questions<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>During the conversation, work in the following topics: * your budget, as this has an impact development and the time that the development may take. It also means that if there are many stages to your site development. Scalability of the site will needs accounting for * what resources you have in your business. Is there enough to maintain content after the website has launched? A website and social media presence requires attention once launched. Does the web technologist have any strategies to help you with this attention so you can flourish or not.? * a portfolio of work done for other clients like you, to show abilities * what is in the contract terms and what copyrights do you hold after the site has launched? This is important. I have seen several businesses find out at launch the web technologist ‘owns’ the rights. Depending on your countries Copyright Law. Any images or content are, either owned by yourself outright or, under license (in the case of media). The terms of the contract also means that there will be a specific payment plan. Take this into account with your budget. Do they actually have a contract for you to sign? BIG warning flashing signs if you do not get a contract or proposal\/contract to sign. The contract is to protect you and them. * What is their development process? how involved will you be? do they need you to provide content and when would that need to be available? * Ask when the possible start date is as well as letting them know when the launch of the website needs to happen. Who will they need to liaise with to keep everything on track. * Do they provide any after launch care or support? Is there a maintenance fee or a one off fee? Is it included in your initial budget?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Remember, ask what is there point of difference compared to others in the industry.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The web developer\/designer\/agency may have information on their website. Have a read of it before you get to a meeting. Take a look at it whilst you are researching who to work with.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Accessibility, SEO, User testing, and web standards, include these in your meeting. A topic to cover these is the Development process.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The main reason I prefer to have a discussion with potential clients is all about value fit. I like to work with clients that have projects that fit my values. This is not always possible. I have experienced clients who, I gave contracts to that they have not signed (or read). Clients pay late and\/or asked for extra development not in the original website scope. This was not a good value fit. Discuss all extra work. Let the web technologist re-pitched so that you can look at your priorities and budget. Web technologists do not like working for nothing.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 id=\"after-decision-made\">After decision made<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>After the first meeting, you received the proposal. Make your decision about who will build your website. Sign the contract and send back to them. When sending email confirmation: * do restate the start of work date * put in that you understand the payment requirements, * request the invoice and * PAY them according to their terms. It always seems a struggle to get the right web technologist to build you website. Once you have found them then you will never have to find another one. Keep in mind the points made in this article, and you will find a web technologist that works with you. Not their own agenda or for you. Remember, just because there is a list of questions doesn’t mean that you get the right web technologist.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If you like what you have read then do not hesitate to <a href=\"https:\/\/graphitedge.tempurl.host\/contact\/\" data-type=\"page\" data-id=\"8\">contact me<\/a> to start the ball rolling on your next digital project. I can help you with all of the above and then some more.<\/p>\n<!-- \/wp:paragraph -->","post_excerpt":"","post_date":"2021-03-02 14:40:58","post_name":"conversations-with-your-web-developer-agency-or-designer-1","post_author":"me@graphitedge.com.au","post_status":"publish","featured_image":"https:\/\/graphitedge.tempurl.host\/wp-content\/uploads\/2020\/07\/halacious-tZc3vjPCk-Q-unsplash.jpg","post_format":"standard","comment_status":"closed","ping_status":"closed","name":"","featured_image_title":"","featured_image_caption":"","featured_image_alt_text":"","featured_image_description":"","featured_file_name":"","post_category":"technology,wordpress","post_tag":"","blocksy_post_meta_options":"Array","et_enqueued_post_fonts":"Array|Array"},"2997":{"post_title":"Conversations with your Web Developer, Agency or Designer - 2","ID":"2997","post_content":"<!-- wp:paragraph -->\n<p><a href=\"https:\/\/graphitedge.tempurl.host\/conversations-with-your-web-developer-agency-or-designer\/\" data-type=\"post\" data-id=\"2993\">Part 1<\/a><\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 id=\"what-your-web-developer-designer-or-agency-needs-from-you\">What your web developer, designer, or agency needs from you<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>So you are ready to start a your conversation with your web technologist. Great! There are somethings that you can prepare before hand to help them give you the best advice, design and help. # more Firstly, provide information about what your business actually does. This helps the web technologist get a thorough understanding about what you do, who you are, how long you have been in business, your point of difference from your competitors. This information is so important in regards to how you site is designed to support your business. If you are building a house you would like the designer and builder to understand how you would live in that house and any particular lifestyle quirks that the house would need to cater for. Following on from this, how is the site going to support your business? In other words what is the site going to accomplish. This is often called the goal or aim of the website. If it is about selling your products or services then there are a whole section of design decisions that impact on the design compared to a brochure site, with just a blog. If you have a clear understanding about how the site is going to support your business then it means that the web technologist will have a better understanding. Some questions to think about to provide answer to your web technologist are: * Do you want to get more inbound leads, phone enquiries, quote requests? * Is it about brand awareness? What makes you unique in your business sector? Who are your competitors? * Does your audience need educating about your products and services? What pain points are you taking away for your clients\/customers? * Is the site there to promote and encourage sales and conversions. * Do you want to build an email list of prospects to send information to? * Do you want to encourage interaction on the site or on your social media platform? Sometimes if you do not understand what you want your web technologist will be able to help you with a pre-project brainstorming session. Or they may make it apart of the conversation. Either way it does make clear the purpose of your site. The questions about can help you determine what your sites purpose is to be.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 id=\"but-i-already-have-a-site\">But I already have a site<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>If you have a website already, you may think that it makes the new design \/ website easier to do. Some information that you should have ready for the conversation is: * the age of the site - is it older than 12months old * what you love or dislike about editing the site - if you are able to that is * the current content management system (CMS) - what you like or dislike about it * what are the metrics for inbound leads, google analytics (if you have that set up) or conversions. Is it giving you the results that you would like to see? * hosting details - especially if you are staying with the same web hosting company. Regardless of whether you have a current website or not if you have any design style guides (for print even) or a business branding document then this should also be given to the web technologist to use.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 id=\"next-bit-of-information\">Next Bit of Information<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>So you have worked out what you want your site to do as far as your clients\/customers, now is the time to start thinking about the functionality of the website. Do you have any sites that you visit that you like because they are easy to use or have a feature that you think is cool and want to use as well.<br>* What do you consider to be the standard functionality of a website? * Is there to be some sort of inbound marketing capability (email, signup lists etc)? Have you autoresponders set up? * Are you going to write blog articles or have a FAQ section? Or is this going to be more of a latest news type of section? Are visitors to your site going to be able to comment on your articles. * Are you going to have advertising on your site? * Are you going to have demonstration videos, videos generally or a photo gallery? * Do you need to have some sort of catalogue? * Is the site to be viewed on mobile devices? * What sort of forms are you going to have for contact, signups etc.?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 id=\"how-do-i-know-if-this-website-is-successful\">How do I know if this website is successful?<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>This is something only you are the business owner can define. It might be about how many enquiries you get from your site or the number of sales that come through your website. Success sometimes does not come overnight either. There may need to be some tweaks along the way to improve the website. Some common metrics that can be recorded by you are: * how many social media followers you have? * how many signups for your freebie? if you have one that is. * Number of sales through your shopping cart * the average size of a client\/customer’s order&gt; * the activity on the site? what sections are most popular? how long they stay on you site. * The overall traffic (page views) for your site. * how many new enquiries you get from the site?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So once you have all this information ready for your discussion go ahead and book the meeting to kick off your project. If you like what you have read then do not hesitate to contact me to start the ball rolling on your next digital project. I can help you with all of the above and then some more.<\/p>\n<!-- \/wp:paragraph -->","post_excerpt":"","post_date":"2021-03-02 14:43:34","post_name":"conversations-with-your-web-developer-agency-or-designer-2","post_author":"me@graphitedge.com.au","post_status":"publish","featured_image":"","post_format":"standard","comment_status":"closed","ping_status":"closed","name":"","featured_image_title":"","featured_image_caption":"","featured_image_alt_text":"","featured_image_description":"","featured_file_name":"","post_category":"technology,wordpress","post_tag":"","blocksy_post_meta_options":"Array","et_enqueued_post_fonts":"Array|Array"}}